app/controllers/qrcs_controller.rb

  def index
    @qrcs = Qrc.all
---
SELECT "qrcs".* FROM "qrcs"

  def create
    @qrc = Qrc.new(qrc_params)

    if @qrc.save
---
INSERT INTO "qrcs" ("num", "discount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["num", ""], ["discount", ""], ["created_at", "2020-12-13 06:03:32.909356"], ["updated_at", "2020-12-13 06:03:32.909356"]]

  def destroy
    @qrc.destroy
---
DELETE FROM "qrcs" WHERE "qrcs"."id" = $1  [["id", 1]]

    def set_qrc
      @qrc = Qrc.find(params[:id])
---
SELECT "qrcs".* FROM "qrcs" WHERE "qrcs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]